
&НаКлиенте
Процедура Тест(Команда)

//	ОбъектыПечати = Новый СписокЗначений;
//	ОбъектыПечати.Добавить(Объект.СсылкаНаОбъект); 
//	
//	МассивПечатныхФорм = ТестНаСервере(ОбъектыПечати,ПодтверждениеДиректора);
//	
//	УправлениеПечатьюКлиент.ПечатьДокументов(МассивПечатныхФорм,ОбъектыПечати,ЭтаФорма);
//	
	БазовыйМакет = ТестНаСервере(Объект.СсылкаНаОбъект);
	БазовыйМакет.Показать();
КонецПроцедуры


//ОбъектПечати, ПодтверждениеДиректора
&НаСервере
Функция ТестНаСервере(СсылкаНаДокумент)
	//ОбработкаОбъекта = РеквизитФормыВзначение("Объект");
	//
	//МассивОбъектов = Новый Массив;
	//МассивОбъектов.Добавить(ОбъектПечати[0].значение);
	////МассивОбъектов.Добавить(ОбъектПечати[1].значение);
	//
	//КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("БазовыйМакет");
	//
	//ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода(); 
	//
	//ПараметрыПечати = Новый Структура;
	////ПараметрыПечати.Вставить("ПодтверждениеДиректора",ПодтверждениеДиректора);
	//
	//ОбработкаОбъекта.Печать(МассивОбъектов,ПараметрыПечати,КоллекцияПечатныхФорм,ОбъектПечати,ПараметрыВывода);
	//
	//МассивПечатныхФорм = ОбщегоНазначения.ТаблицаЗначенийВМассив(КоллекцияПечатныхФорм);
	//
	//Возврат  МассивПечатныхФорм;
	Табдок = СформироватьБазовыйМакет(СсылкаНаДокумент);
	возврат табдок;
КонецФункции

//текущий документ - ссылка на наш документ
&НаСервере
Функция СформироватьБазовыйМакет(ТекущийДокумент) 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет = ОбработкаОбъект.ПолучитьМакет("БазовыйМакет");
	ОсновнаяОбласть = Макет.получитьОбласть("ОснованяОбласть");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК Ссылка,
		|	РасходнаяНакладная.Дата КАК Дата,
		|	&Ссылка КАК Ссылка1
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда   
		
		ОсновнаяОбласть.Параметры.ДатаДокумента = ВыборкаДетальныеЗаписи.Дата;
		ОсновнаяОбласть.Параметры.СсылкаНаДокумент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОсновнаяОбласть);
	
	возврат ТабличныйДокумент;
КонецФункции
