
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда1(Команда)
	
	Тест1 = "ау";
	Тест2 = Истина;
	Тест3 = 4;
	Тест5 = Дата(2026,07,04,1,1,1);
	
	Результат = ЗаполнениеСтруктуры(Тест5);
	
КонецПроцедуры // сюда точку отладки ставь и смотри что в переменной Результат

&НаКлиенте
Процедура Команда2(Команда)
	
	Нашмассив = новый массив;
	Нашмассив.Добавить("  ООО Ромашка  ");
	Нашмассив.Добавить("ооо ромашка");
	Нашмассив.Добавить("Оо ромашка");
	Нашмассив.Добавить("Ип ЛеС");
	Нашмассив.Добавить("ИП  Лес");
	Нашмассив.Добавить("ИП Лес");
	
	Результат = УникальныеСтрокиИзМассива(Нашмассив);
	
КонецПроцедуры // сюда точку отладки ставь и смотри что в переменной Результат

&НаКлиенте
Процедура Команда3(Команда)

	тест11 = Дата('2025.01.01');
	тест12 = Дата('2025.02.02');
	
	
	Результат = ПолучитьТаблицуЗначенийПоДатам(тест11,тест12)

КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
	тест1 = новый массив;
	тест1.Добавить(" a-01 ");
	тест1.Добавить("A-01");
	тест1.Добавить("B-02");
	тест1.Добавить("A-01");
	тест1.Добавить("b-02");
	
	результат = НормализироватьМассив(тест1);
КонецПроцедуры


&НаСервере
Процедура Команда5НаСервере()
	Таблица = Новый ТаблицаЗначений;
	таблица.Колонки.добавить("Номенклатура",,"Номенклатура");
	таблица.Колонки.добавить("Склад",,"Склад");
	таблица.Колонки.добавить("Количество",,"Количество");
	таблица.Колонки.добавить("Цена",,"Цена");
	Стр=Таблица.Добавить();
	Стр.Номенклатура="Товар А";
	Стр.Склад="склад 1";
	Стр.Количество= 12;
	стр.цена = 200;
	Стр=Таблица.Добавить();
	Стр.Номенклатура="Товар А";
	Стр.Склад="склад 2";
	Стр.Количество= 1;
	стр.цена = 1000;
	Стр=Таблица.Добавить();
	Стр.Номенклатура="Товар B";
	Стр.Склад="склад 1";
	Стр.Количество= 5;
	стр.цена = 210;
	
	результат = СводСтрокЗаказа(Таблица);

КонецПроцедуры

&НаКлиенте
Процедура Команда5(Команда)
	Команда5НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда6НаСервере()
	Таблица = новый ТаблицаЗначений;
	КонтрольнаяДата = Дата('2026.01.01');
	
	таблица.Колонки.Добавить("НомерСтроки",,"НомерСтроки");
	таблица.Колонки.Добавить("Номенклатура",,"Номенклатура");
	таблица.Колонки.Добавить("Количество",,"Количество"); // Новый описаниеТипов("Число") ?
	таблица.Колонки.Добавить("Цена",,"Цена");
	таблица.Колонки.Добавить("ДатаОтгрузки",,"ДатаОтгрузки"); // новый квалификаторДаты ?
	
	строка = Таблица.Добавить();
	строка.НомерСтроки = 1;
	строка.Номенклатура = "Склад";
	строка.Количество =  -1;
	строка.Цена = 10000;
	строка.ДатаОтгрузки = '2026.01.02';
	строка = Таблица.Добавить();
	строка.НомерСтроки = 2;
	строка.Номенклатура = "";
	строка.Количество =  5;
	строка.Цена = -1002;
	строка.ДатаОтгрузки = '2023.01.01';
	строка = Таблица.Добавить();
	строка.НомерСтроки = 3;
	строка.Номенклатура = "Склад";
	строка.Количество =  1;
	строка.Цена = 10000;
	строка.ДатаОтгрузки ='2026.02.01';
	
	результат = ПоискОшибокВТаблица(Таблица,КонтрольнаяДата);
КонецПроцедуры

&НаКлиенте
Процедура Команда6(Команда)
	Команда6НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда7НаСервере()
	Таблица = новый ТаблицаЗначений;
	таблица.Колонки.Добавить("Номенклатура",,"Номенклатура");
	таблица.Колонки.Добавить("Сумма",,"Сумма");
	N = 5;
	
	ЗаполнитьТаблицаЗадание7(Таблица,"Склад",50000);
	ЗаполнитьТаблицаЗадание7(Таблица,"Доставка",25000);
	ЗаполнитьТаблицаЗадание7(Таблица,"Склад",25000);
	ЗаполнитьТаблицаЗадание7(Таблица,"Документы",100000);
	ЗаполнитьТаблицаЗадание7(Таблица,"Склад",1234);
	ЗаполнитьТаблицаЗадание7(Таблица,"Документы",70000);
	ЗаполнитьТаблицаЗадание7(Таблица,"Склад",24000);
	ЗаполнитьТаблицаЗадание7(Таблица,"Склад",1234);
	
	результат = ВозвратПервыхNстрокТаблицы(Таблица,N);
КонецПроцедуры

&НаКлиенте
Процедура Команда7(Команда)
	Команда7НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда8НаСервере()
	
	ТаблицаКоэффицентов = Новый ТаблицаЗначений;
	
	ДобавлениеКолонокВТаблицуЗначений(ТаблицаКоэффицентов,"Получатель","Получатель");
	ДобавлениеКолонокВТаблицуЗначений(ТаблицаКоэффицентов,"Коэффицент","Коэффицент");
	
	ЗаполнитьКолонкиТаблицыЗначениями(ТаблицаКоэффицентов,"Первый",1);
	ЗаполнитьКолонкиТаблицыЗначениями(ТаблицаКоэффицентов,"Второй",2);
	ЗаполнитьКолонкиТаблицыЗначениями(ТаблицаКоэффицентов,"Третий",3);
	ЗаполнитьКолонкиТаблицыЗначениями(ТаблицаКоэффицентов,"Четвёртый",5);
	
	ОбщаяСумма = 300;
	
	РаспределитьОбщуюСуммуПоКоэффицентам(ТаблицаКоэффицентов,ОбщаяСумма);
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8(Команда)
	
	Команда8НаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Команда9НаСервере()
	
	ТребуемоеКоличество = 100;
	ТаблицаСкладовПоПриоритет = Новый ТаблицаЗначений;
	ТаблицаСкладовПоПриоритет.Колонки.Добавить("склад",,"склад");
	ТаблицаСкладовПоПриоритет.Колонки.Добавить("Остаток",,"Остаток");
	
	ЗаполнениеТаблицыСкладов(ТаблицаСкладовПоПриоритет,"Склад 1", 30);
	ЗаполнениеТаблицыСкладов(ТаблицаСкладовПоПриоритет,"Склад 2", 20);
	ЗаполнениеТаблицыСкладов(ТаблицаСкладовПоПриоритет,"Склад 3", 0);
	ЗаполнениеТаблицыСкладов(ТаблицаСкладовПоПриоритет,"Склад 4", 90);
	ЗаполнениеТаблицыСкладов(ТаблицаСкладовПоПриоритет,"Склад 5", 30);
	
	ЗапросКоличестваСоСкладов(ТаблицаСкладовПоПриоритет,ТребуемоеКоличество);
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9(Команда)
	Команда9НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда10НаСервере()

	КоличествоТовара = 300;
	КоличествоТовараВОднойУпаковке = 20.5;
	
	УпаковкаТовара(КоличествоТовара,КоличествоТовараВОднойУпаковке);
	
КонецПроцедуры

&НаКлиенте
Процедура Команда10(Команда)
	Команда10НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда11НаСервере()
	
	ТаблицаДрево = Новый ТаблицаЗначений;
	ТаблицаДрево.Колонки.Добавить("Путь",,"Путь");
	ТаблицаДрево.Колонки.Добавить("Сумма",,"Сумма");
	
	ЗаполнениеТаблицыДрева(ТаблицаДрево,"Продажи/Онлайн/Сайт",100);
	ЗаполнениеТаблицыДрева(ТаблицаДрево,"Продажи/Онлайн/Маркетплейсы",150);
	ЗаполнениеТаблицыДрева(ТаблицаДрево,"Продажи/Розница",200);
	ЗаполнениеТаблицыДрева(ТаблицаДрево,"Сервис",50);
	
	результат = ТаблицаВДревоЗначений(ТаблицаДрево);
	
КонецПроцедуры

&НаКлиенте
Процедура Команда11(Команда)
	Команда11НаСервере();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВыполненныеЗадачи


&НаКлиенте
Функция ЗаполнениеСтруктуры(ЗначениеПользователя)
	
	Узнавалка = Новый Структура;
	узнавалка.Вставить("Тип",ТипЗнч(ЗначениеПользователя) );
	узнавалка.Вставить("ЭтоНеопределено",ЗначениеПользователя = Неопределено );
	узнавалка.Вставить("ЭтоNull", ЗначениеПользователя = null );
	узнавалка.Вставить("Заполнено", ЗначениеЗаполнено(ЗначениеПользователя) );
	узнавалка.Вставить("Представление",Строка(ЗначениеПользователя) );
	
	Возврат Узнавалка;
	
КонецФункции // ЗаполнениеСтруктуры()

Функция УникальныеСтрокиИзМассива(Нашмассив)
	
	массивСорт = новый массив();
	
	СоответствиеСорт = новый Соответствие;
	Для Индекс = 0 По Нашмассив.ВГраница() Цикл
		текущийЭлемент = Нашмассив[Индекс];
		текущийЭлемент = СокрЛП(текущийЭлемент);
		Если ПустаяСтрока(ТекущийЭлемент) Тогда
			Продолжить;
		КонецЕсли;
		массив1 = СтрРазделить(текущийЭлемент, " ", Ложь);
		текущийЭлемент = СтрСоединить(массив1, " ");
		ключ = Нрег(текущийЭлемент);
		Если СоответствиеСорт.Получить(Ключ) = Неопределено  Тогда
			СоответствиеСорт.вставить(Ключ,Истина);
			массивСорт.Добавить(ТекущийЭлемент);
		КонецЕсли;
	КонецЦикла;
	
	Возврат массивСорт;
	
КонецФункции


&НаСервере
Функция ПолучитьТаблицуЗначенийПоДатам(ДатаНачала, ДатаОкончания)

	ТаблицаЗначенийДата = Новый ТаблицаЗначений;
	
	ТаблицаЗначенийДата.Колонки.Добавить("Дата",,"Дата");//  Дата('2017.03.23 10:45:25')
	ТаблицаЗначенийДата.Колонки.Добавить("ДеньНедели",,"ДеньНедели"); // пятница суббота
	ТаблицаЗначенийДата.Колонки.Добавить("НачалоНедели",,"НачалоНедели");// начало недели 07.01.2026
	ТаблицаЗначенийДата.Колонки.Добавить("НачалоМесяца",,"НачалоМесяца"); // начало месяца 01.01.2026
	ТаблицаЗначенийДата.Колонки.Добавить("Выходной",,"Выходной"); // булевое
	
	// ДеньНедели
	// НачалоПериода
	
	Если ДатаНачала > ДатаОкончания Тогда
	
		Сообщить("Ошибка: Дата начала не может быть раньше даты окончания!");
		возврат Null; 
	
	Иначе
		ТекущаяДата = НачалоДня(ДатаНачала);
		Пока ТекущаяДата <= НачалоДня(ДатаОкончания) Цикл
		
		Стр = ТаблицаЗначенийДата.Добавить();
		стр.Дата = ТекущаяДата;
		стр.ДеньНедели = ДеньНедели(ТекущаяДата);
		стр.НачалоНедели = НачалоНедели(ТекущаяДата);
		стр.НачалоМесяца = НачалоМесяца(ТекущаяДата);
		
		Если стр.ДеньНедели = 6 ИЛИ  стр.ДеньНедели= 7 Тогда
			стр.Выходной = "Да";
		Иначе
			стр.Выходной = "Нет";
			
		КонецЕсли;
		ТекущаяДата = ТекущаяДата + 86400;
		
		КонецЦикла;

		

		возврат ТаблицаЗначенийДата;
	
	КонецЕсли;


КонецФункции // ПолучитьТаблицуЗначенийПоДатам()

&НаСервере
Функция НормализироватьМассив(ВходнойМассив)
	
	ТаблицаЗначенийМассив = новый ТаблицаЗначений;
	
	ТаблицаЗначенийМассив.колонки.Добавить("Код",,"Код");
	ТаблицаЗначенийМассив.колонки.Добавить("Количество",,"Количество");
	ТаблицаЗначенийМассив.колонки.Добавить("ПерваяПозиция",,"ПерваяПозиция");
	ТаблицаЗначенийМассив.колонки.Добавить("ЭтоДубль",,"ЭтоДубль");
	
	СоответствиеКоличества = новый Соответствие;
	соответсвтиеУникальности = новый Соответствие;
	
	Для Индекс = 0 По ВходнойМассив.ВГраница() Цикл
	
		ЭлементМассива = ВходнойМассив[Индекс];
		ЭлементМассива = СокрЛП(ЭлементМассива);
		Если ПустаяСтрока(ЭлементМассива) Тогда
			Продолжить;
		КонецЕсли;
		ключ = Врег(ЭлементМассива);
		Если СоответствиеКоличества.Получить(Ключ) = неопределено тогда
			СоответствиеКоличества.вставить(ключ,1);
		иначе
			СоответствиеКоличества.Вставить(Ключ,СоответствиеКоличества.получить(ключ) + 1)
		конецесли;
		
		Если соответсвтиеУникальности.Получить(Ключ) = Неопределено  Тогда
			соответсвтиеУникальности.вставить(Ключ,Индекс); // индекс первая позиция
		конецЕсли
		
	КонецЦикла;
	
	

	Для каждого Элемента Из соответсвтиеУникальности Цикл
		

		стр = ТаблицаЗначенийМассив.добавить();
		стр.код = Элемента.Ключ;
		стр.Количество = СоответствиеКоличества.Получить(Элемента.ключ);

		стр.ПерваяПозиция = Элемента.значение;
		
		Если стр.количество > 1 Тогда
		
			стр.ЭтоДубль = Истина;
		
		Иначе
		
			Стр.ЭтоДубль = ложь;
		
		КонецЕсли;
	КонецЦикла;
	
возврат ТаблицаЗначенийМассив;

КонецФункции 

Функция СводСтрокЗаказа(Таблица)

	ТаблицаСортировка = Новый ТаблицаЗначений;
	ТаблицаСортировка.Колонки.добавить("Номенклатура",,"Номенклатура");
	ТаблицаСортировка.Колонки.добавить("Склад",,"Склад");
	ТаблицаСортировка.Колонки.добавить("Количество",,"Количество");
	ТаблицаСортировка.Колонки.добавить("Сумма",,"Сумма");
	
	СоответствиеКлючей= новый соответствие;
	
	Для каждого Элемент Из Таблица Цикл
		
		ключ = строка(Элемент.Номенклатура) + строка(Элемент.Склад); //идея - сложить 2 строки и получить 1 строку - ключ
		
		Если СоответствиеКлючей.Получить(Ключ) = неопределено Тогда
			
			стр = ТаблицаСортировка.добавить(); // добавляем если новый ключ
			стр.номенклатура = Элемент.номенклатура;
			стр.склад = Элемент.склад;
			стр.количество = Элемент.количество;
			стр.сумма = Элемент.количество * Элемент.цена;
			
			СоответствиеКлючей.Вставить(Ключ,стр); // сохраняется ссылка на строку
		Иначе
			
			СуществующаяСтрока = СоответствиеКлючей.получить(ключ);
			СуществующаяСтрока.Количество = СуществующаяСтрока.Количество + Элемент.количесиво;
			СуществующаяСтрока.сумма = СуществующаяСтрока.сумма + Элемент.сумма;
			
		КонецЕсли;
	КонецЦикла;
	
	возврат ТаблицаСортировка;

КонецФункции // СводСтрокЗаказа()


Функция ПоискОшибокВТаблица(Таблица,КонтрольнаяДата)
// Одно большое или нельзя сделать только 1 ошибку найдёт
// может сделать флаги на каждую возможную ошибку и в конце цикла проверки их снова Ложь делать?
	

	ТаблицаСОшибками = Новый ТаблицаЗначений;
	ТаблицаСОшибками.Колонки.Добавить("НомерСтроки",,"НомерСтроки");
	ТаблицаСОшибками.Колонки.Добавить("Поле",,"Поле");
	ТаблицаСОшибками.Колонки.Добавить("КодОшибки",,"КодОшибки");
	ТаблицаСОшибками.Колонки.Добавить("ТекстОшибки",,"ТекстОшибки");

	Для каждого Элемент Из Таблица Цикл
		стр = ТаблицаСОшибками.Добавить(); // даже при 0 ошибок таблица возвращается
		
		Если Элемент.Номенклатура = неопределено Тогда
			
			стр.НомерСтроки = Элемент.НомерСтроки;
			стр.Поле = Строка(стр.поле) + " Номенклатура ";
			стр.КодОшибки = Строка(стр.кодОшибки) + " ОшибкаНоменклатура ";
			стр.ТекстОшибки = Строка(стр.ТекстОшибки) + " номенклатура не заполнена ";
			
		КонецЕсли;
		
		Если ТипЗнч(Элемент.количество) <> ТипЗнч(10) Тогда
		
			стр.НомерСтроки = Элемент.НомерСтроки;
			стр.Поле = Строка(стр.поле) + " количество ";
			стр.КодОшибки = Строка(стр.кодОшибки) + " ОшибкаТипаКоличество ";
			стр.ТекстОшибки = Строка(стр.ТекстОшибки) + " поле количество не тип число ";
			
		КонецЕсли;
		
		Если Элемент.количество <= 0 Тогда
			
			стр.НомерСтроки = Элемент.НомерСтроки;
			стр.Поле = Строка(стр.поле) + " количество ";
			стр.КодОшибки = Строка(стр.кодОшибки) + " ОшибкаКоличество ";
			стр.ТекстОшибки = Строка(стр.ТекстОшибки) + " количество не больше нуля ";
			
		КонецЕсли;
		Если ТипЗнч(Элемент.Цена) <> ТипЗнч(10) Тогда
			
			стр.НомерСтроки = Элемент.НомерСтроки;
			стр.Поле = Строка(стр.поле) + " цена ";
			стр.КодОшибки = Строка(стр.кодОшибки) + " ОшибкаТипаЦена ";
			стр.ТекстОшибки = Строка(стр.ТекстОшибки) + " поле цена не тип число ";
			
		КонецЕсли;
		
		Если Элемент.цена < 0 Тогда
			
			стр.НомерСтроки = Элемент.НомерСтроки;
			стр.Поле = Строка(стр.поле) + " цена ";
			стр.КодОшибки = Строка(стр.кодОшибки) + " ОшибкаЦена ";
			стр.ТекстОшибки = Строка(стр.ТекстОшибки) + " цена меньше нуля ";
			
		КонецЕсли;
		
		Если ТипЗнч(Элемент.ДатаОтгрузки) <> ТипЗнч('2025.10.10') Тогда
			
			стр.НомерСтроки = Элемент.НомерСтроки;
			стр.Поле = Строка(стр.поле) + " ДатаОтгрузки ";
			стр.КодОшибки = Строка(стр.кодОшибки) + " ОшибкаТипаДатаОтгрузки ";
			стр.ТекстОшибки = Строка(стр.ТекстОшибки) + " поле ДатаОтгрузки не тип дата ";
			
		КонецЕсли;
		Если Элемент.ДатаОтгрузки < КонтрольнаяДата Тогда
			
			стр.НомерСтроки = Элемент.НомерСтроки;
			стр.Поле = Строка(стр.поле) + " ДатаОтгрузки ";
			стр.КодОшибки = Строка(стр.кодОшибки) + " ОшибкаДатаОтгрузки ";
			стр.ТекстОшибки = Строка(стр.ТекстОшибки) + " дата отгрузки раньше контрольной даты";
			
		КонецЕсли;
	КонецЦикла;
	возврат ТаблицаСОшибками;
КонецФункции // ПоискОшибокВТаблица()

#КонецОбласти


#Область Задача7


Функция ВозвратПервыхNстрокТаблицы(ТаблицаВходная,N)
	
	Если ТаблицаВходная.Количество() = 0 Тогда
	
		возврат Null;
	
	КонецЕсли;
	
	Если N <= 0 Тогда
	
		возврат Новый ТаблицаЗначений;
	
	КонецЕсли;
	
	Если N > ТаблицаВходная.Количество() Тогда
	
		N = ТаблицаВходная.количество();
	
	КонецЕсли;
//  встроенная функция сортировки
	МестоВСортировке = 1;
	ОтсортированнаяТаблица = новый ТаблицаЗначений;
	ОтсортированнаяТаблица.Колонки.Добавить("Место",,"Место");
	ОтсортированнаяТаблица.Колонки.Добавить("Номенклатура",,"Номенклатура");
	ОтсортированнаяТаблица.Колонки.Добавить("Сумма",,"сумма");
	
	
	ВременнаяТаблицаКопияВходная = ТаблицаВходная.скопировать();
	ВременнаяТаблицаКопияВходная.Сортировать("Сумма Убыв, номенклатура");
	
	Для каждого ЭлементВременнаяТаблица Из ВременнаяТаблицаКопияВходная Цикл
	
		ЗаполнениеОтсортированнаяТаблица(ОтсортированнаяТаблица,МестоВСортировке,
		ЭлементВременнаяТаблица.Номенклатура,ЭлементВременнаяТаблица.Сумма);
		МестоВСортировке = МестоВСортировке + 1;
	КонецЦикла;
	
	Возврат ОтсортированнаяТаблица;

КонецФункции


Функция ЗаполнитьТаблицаЗадание7(Таблица,НоменклатураВход, суммаВход)

	строка = таблица.Добавить();
	строка.Номенклатура = НоменклатураВход;
	строка.сумма = суммаВход;
	

КонецФункции // ЗаполнениеТаблицыЗадание7()

Функция ЗаполнениеОтсортированнаяТаблица(ВременнаяТаблица,Номер,НоменклатураВход,СуммаВход)

	Строка 				= ВременнаяТаблица.Добавить();
	строка.Место		= Номер;
	строка.Номенклатура = НоменклатураВход;
	строка.Сумма 		= СуммаВход;

КонецФункции // ЗаполнениеВременнаяТаблицаКопияОсновная()


#КонецОбласти


#Область Задание8

Функция РаспределитьОбщуюСуммуПоКоэффицентам (ТаблицаСКоэффицентами,ОбщаяСумма)

	// Проверки
	Если ОбщаяСумма < 0 Тогда
		
		Возврат неопределено
		
	КонецЕсли;
	
	ОбщаяСуммаКоэффицентов = 0;
	МаксимальныйКоэф = 0;
	ИндексСтрокиСМаксимальнымКоэф = 0;

	
	Для каждого ЭлементТаблицыКоэф Из ТаблицаСКоэффицентами Цикл
		
		Если ЭлементТаблицыКоэф.Коэффицент < 0 Тогда
			
			Возврат Неопределено
			
		КонецЕсли;
		
		ОбщаяСуммаКоэффицентов = ОбщаяСуммаКоэффицентов + ЭлементТаблицыКоэф.Коэффицент;
		
		Если ЭлементТаблицыКоэф.Коэффицент > МаксимальныйКоэф Тогда
			
			МаксимальныйКоэф = ЭлементТаблицыКоэф.Коэффицент;
			ИндексСтрокиСМаксимальнымКоэф = ТаблицаСКоэффицентами.Индекс(ЭлементТаблицыКоэф);
			// Получаем индекс строки с максимальным коэффицентом
			
		КонецЕсли;

	КонецЦикла;
	
	Если ОбщаяСуммаКоэффицентов < 0 Тогда
		
		Возврат неопределено
		
	КонецЕсли;
	//проверки пройдены
	
	ТаблицаСКоэффицентами.колонки.добавить("Распределено",,"Распределено");
	Доля = Окр(ОбщаяСумма / ОбщаяСуммаКоэффицентов,2);// доля на единицу коэффицента
	ОбщаяСуммаРаспределённыхПоКоэф = 0;  // переменная для проверки остатка
	
	Для каждого ЭлементИсходнойТаблицы Из ТаблицаСКоэффицентами Цикл
		
		ЭлементИсходнойТаблицы.Распределено = Доля * ЭлементИсходнойТаблицы.Коэффицент;
		ОбщаяСуммаРаспределённыхПоКоэф = ОбщаяСуммаРаспределённыхПоКоэф 
		+ ЭлементИсходнойТаблицы.Распределено;
		
		Если ТаблицаСКоэффицентами.Индекс(ЭлементТаблицыКоэф) = ИндексСтрокиСМаксимальнымКоэф Тогда
			
			ЭлементИсходнойТаблицы.Распределено = ЭлементИсходнойТаблицы.Распределено +
			общаяСумма - ОбщаяСуммаРаспределённыхПоКоэф;
			// если остаток при разности общей суммы есть, он находится и прибавляется к максимальному индексу
			
		КонецЕсли;
		
	КонецЦикла;
	

КонецФункции 


Функция ДобавлениеКолонокВТаблицуЗначений(ТаблицаВход,КолонкаНазвание,КолонкаОпиание)

	ТаблицаВход.колонки.добавить(КолонкаНазвание,,КолонкаОпиание);

КонецФункции // ДобавлениеКолонокВТаблицуЗначений()

Функция ЗаполнитьКолонкиТаблицыЗначениями(Таблица,Получатель,Коэффицент)

	Строка 			  = Таблица.Добавить();
	строка.Получатель = Получатель;
	строка.Коэффицент = Коэффицент;

КонецФункции // ЗаполнениеВременнаяТаблицаКопияОсновная()

#КонецОбласти


#Область Задание9

Функция ЗапросКоличестваСоСкладов (ТаблицаСоСкладами, Потребность)
	//Проверки
	Если Потребность <= 0 Тогда
		
		Сообщить("Потребность нулевая/меньше нуля.");
		Возврат Неопределено
		
	КонецЕсли;
	
	Если ТаблицаСоСкладами.количество() = 0 Тогда
		
		Сообщить("Входная таблица пустая.");
		Возврат Неопределено
		
	КонецЕсли;
	//конецПроверок

	Недопоставка = 0;
	КоличествоПотребности = Потребность;
	
	Результат = ТаблицаСоСкладами.Скопировать();
	Результат.колонки.Добавить("КОтгрузке",,"КОтгрузке");
	
	Для каждого ЭлементТаблицаСоСкладами Из ТаблицаСоСкладами Цикл
		
		КоличествоПотребности = КоличествоПотребности - 
		ЭлементТаблицаСоСкладами.Остаток;
		
		СтрокаРезультата = Результат.добавить();
		СтрокаРезультата.склад = ЭлементТаблицаСоСкладами.склад;
		СтрокаРезультата.остаток= ЭлементТаблицаСоСкладами.остаток;
		
		Если КоличествоПотребности <= 0  Тогда
			//если перегрузило 30 - 70 = -40 70 + (-40) = 30
			СтрокаРезультата.КОтгрузке = ЭлементТаблицаСоСкладами.Остаток + 
			КоличествоПотребности;
			Сообщить("Недопоставка = " + Недопоставка);
			Возврат Результат;
			
		Иначе
			СтрокаРезультата.КОтгрузке = ЭлементТаблицаСоСкладами.Остаток;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоПотребности > 0 Тогда
		
		
		Сообщить("Недопоставка = " + КоличествоПотребности);
		Возврат Результат;
		
	КонецЕсли;

КонецФункции // ()



Функция ЗаполнениеТаблицыСкладов(ТаблицаСкладов,Склад,ОстатокНаСкладе)

	СтрокаТаблицыСкладов = ТаблицаСкладов.Добавить();
	СтрокаТаблицыСкладов.Склад = Склад;
	СтрокаТаблицыСкладов.Остаток = ОстатокНаСкладе;

КонецФункции 


#КонецОбласти

#Область Задание10

Функция УпаковкаТовара(КоличествоТовара,ТовараВУпаковке)
	// на удивление лёгкая задача, мало ограничивающих условий.

	Если ТовараВУпаковке <= 0 Тогда
	
		Сообщить("Товара в упаковке не может быть меньше нуля, или равно нулю! ");
		Возврат Неопределено;
	
	КонецЕсли;
	
	ПолныхУпаковок = Цел(КоличествоТовара / ТовараВУпаковке);
	ОстатокТовара = КоличествоТовара % ТовараВУпаковке;
	ГрузовыхМест = ПолныхУпаковок;
	
	Если ОстатокТовара > 0 Тогда
	
		ГрузовыхМест = ГрузовыхМест+1
	
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область Задача11

Функция ТаблицаВДревоЗначений (ИсходнаяТаблица)

	ДеревоКатегорий = Новый ДеревоЗначений;
	
	ДеревоКатегорий.Колонки.Добавить("Наименование",,"Наименование");
	ДеревоКатегорий.Колонки.Добавить("Сумма",,"Сумма");
	
	Для Каждого СтрокаТаблицы Из ИсходнаяТаблица Цикл
		
		МассивРазделённыхЗначений = СтрРазделить(СтрокаТаблицы.Путь, "/");
		КоллекцияСтрок = ДеревоКатегорий.Строки;
		
		Для Каждого ЭлементМассива Из МассивРазделённыхЗначений Цикл

			Если ПустаяСтрока(ЭлементМассива) Тогда
			
				Продолжить;
				
			КонецЕсли;
			// если дерево пустое то флаг остаётся неопределено	
			НайденнаяСтрока = Неопределено;
			
			// цикл для проверки добавление новый ветки продажи -> онлайн -> сайт/маркетплейсы
			Для Каждого ВеткаДерева Из КоллекцияСтрок Цикл
				
				Если ВеткаДерева.Наименование = ЭлементМассива Тогда
					
					НайденнаяСтрока = ВеткаДерева;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			// если уже что то есть то добавляем в эту ветвь следующую
			Если НайденнаяСтрока = Неопределено Тогда
				
				НайденнаяСтрока = КоллекцияСтрок.Добавить();
				НайденнаяСтрока.Наименование = ЭлементМассива;
				НайденнаяСтрока.Сумма = 0;
			КонецЕсли;
			// строится лесенка дерева, 1 продажи -> 2 онлайн -> 3 сайт
			КоллекцияСтрок = НайденнаяСтрока.Строки;
			
		КонецЦикла;
		// добавление последнему звену суммы что бы дальше пойти верх по ветке 
		НайденнаяСтрока.Сумма = НайденнаяСтрока.Сумма + СтрокаТаблицы.Сумма;
		
	КонецЦикла;
	
	Для Каждого СтрокаДерева Из ДеревоКатегорий.Строки Цикл
		
		РассчитатьСумму(СтрокаДерева);
		
	КонецЦикла;
	
	Возврат ДеревоКатегорий;
	
КонецФункции
//рекурсивная функция
Функция РассчитатьСумму(СтрокаДерева)
	
	Для Каждого СтрокаВетка Из СтрокаДерева.Строки Цикл
		
		СтрокаДерева.Сумма = СтрокаДерева.Сумма + РассчитатьСумму(СтрокаВетка);
		
	КонецЦикла;
	
	Возврат СтрокаДерева.Сумма;
	
КонецФункции

Функция ЗаполнениеТаблицыДрева(Таблица,путь,сумма)
	
	строка = Таблица.добавить();
	строка.путь = путь;
	строка.сумма = сумма;
	
КонецФункции



#КонецОбласти

#КонецОбласти







