&НаКлиенте
Процедура ЭкспортИзЭксель(Команда)
		
	ДатаЭкспорта = ДатаУстановкиЦены;
	ВидЦеныЭкпорта = ВидЦены;
	
	ЭкспортИзЭксельНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ЭкспортИзЭксельНаСервере()
	
	Если ПутьКФайлу = Неопределено Тогда
		Сообщить("Не выбран путь к файлу");
		Возврат;
	КонецЕсли;
	
	ТаблицаИзЭксель = Новый ТаблицаЗначений;
	
	ТаблицаИзЭксель.Колонки.Добавить("Номер");                            
	ТаблицаИзЭксель.Колонки.Добавить("Наименование");
	ТаблицаИзЭксель.Колонки.Добавить("ЕдИзм");
	ТаблицаИзЭксель.Колонки.Добавить("Количество");
	ТаблицаИзЭксель.Колонки.Добавить("Цена");
	ТаблицаИзЭксель.Колонки.Добавить("Сумма");

	ПрочитатьФайлЭксель(ПутьКФайлу,ТаблицаИзЭксель);
	
	Если ТаблицаИзЭксель.Количество() > 0 Тогда
		ЗаписьНоменклатурыВСправочник(ТаблицаИзЭксель);
		ЗаписьВДокументУстановкаЦенНоменклатуры(ТаблицаИзЭксель);
	КонецЕсли;
		
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьФайлЭксель(Команда) 
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок			   = "Выберите файл для загрузки";
	Диалог.Фильтр 	 			   = "Файлы Excel (*.xls, *.xlsx)|*.xls;*.xlsx";
	Диалог.ПредварительныйПросмотр = Ложь;
	
	Если Диалог.Выбрать() Тогда
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлЭксель(ИмяФайла,ТаблицаЭксель)
	
	ТабДокНоменклатура = Новый ТабличныйДокумент;
	ТабДокНоменклатура.Прочитать(ИмяФайла);
	
	сч = 15; // номер ячейки начала таблицы
		
	Пока ТабДокНоменклатура.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 2).ТекущаяОбласть.текст <> "" Цикл 
		
		СтрокаТаблицы = ТаблицаЭксель.Добавить();		
		
		СтрокаТаблицы.Номер			= Строка(ТабДокНоменклатура.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C" + 2).ТекущаяОбласть.Текст);
		СтрокаТаблицы.Наименование	= Строка(ТабДокНоменклатура.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 3).ТекущаяОбласть.Текст);
		СтрокаТаблицы.ЕдИзм			= Строка(ТабДокНоменклатура.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 7).ТекущаяОбласть.Текст);
		СтрокаТаблицы.Количество	= Строка(ТабДокНоменклатура.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 10).ТекущаяОбласть.Текст);
		СтрокаТаблицы.Цена			= Строка(ТабДокНоменклатура.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 12).ТекущаяОбласть.Текст);
		СтрокаТаблицы.Сумма			= Строка(ТабДокНоменклатура.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C" + 13).ТекущаяОбласть.Текст);
		
		сч = сч + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписьВДокументУстановкаЦенНоменклатуры(ТаблицаИзЭксель)
	
	ДокументУстановкаЦен = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	
	//Для каждого СтрокаЦен из ДокументУстановкаЦен.ВидыЦен Цикл
	//	Если СтрокаЦен.ВидыЦен.Вид = ВидЦены Тогда
	//		СтрокаЦен.ВидыЦен.Использование = Истина;
	//	КонецЕсли;
	//КонецЦикла;
	
	ДокументУстановкаЦен.Дата = ДатаУстановкиЦены;
	
	Для каждого СтрокаТаблицы из ТаблицаИзЭксель Цикл
		строкаТабличнойЧасти 				  = ДокументУстановкаЦен.Запасы.Добавить();
		строкаТабличнойЧасти.Номенклатура 	  = Справочники.Номенклатура.НайтиПоНаименованию(
		СтрокаТаблицы.Наименование);
		строкаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТаблицы.ЕдИзм;		
		строкаТабличнойЧасти.ВидЦены 		  = ВидЦены;		
		строкаТабличнойЧасти.Цена 			  = Число(СтрокаТаблицы.Цена);			
	КонецЦикла;
	
	ДокументУстановкаЦен.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписьНоменклатурыВСправочник(ТаблицаИзЭксель)
	
	Для каждого СтрокаТаблицы из ТаблицаИзЭксель Цикл
		Если Справочники.Номенклатура.НайтиПоНаименованию(СтрокаТаблицы.Наименование) 
			= Справочники.Номенклатура.ПустаяСсылка() Тогда
			СправочникНоменклатуры 						 = Справочники.Номенклатура.СоздатьЭлемент();
			СправочникНоменклатуры.Наименование			 = СтрокаТаблицы.Наименование;
			СправочникНоменклатуры.ЕдиницаИзмерения	 	 = СтрокаТаблицы.ЕдИзм;		
			СправочникНоменклатуры.КатегорияНоменклатуры = КатегорияНоменклатуры;
			СправочникНоменклатуры.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры